# El tratamiento de variables categóricas

In [98]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [99]:
df = pd.read_csv("C:/Users/Megaport/Desktop/python/datos machine learning/ecom-expense/Ecom Expense.csv")

In [100]:
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [101]:
dummy_gender = pd.get_dummies(df["Gender"], prefix="Gender")
dummy_city_tier = pd.get_dummies(df["City Tier"], prefix="City")
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [102]:
dummy_city_tier.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [103]:
column_name= df.columns.values.tolist()
column_name

['Transaction ID',
 'Age ',
 ' Items ',
 'Monthly Income',
 'Transaction Time',
 'Record',
 'Gender',
 'City Tier',
 'Total Spend']

In [104]:
df_new = df[column_name].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0

In [105]:
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [106]:
feature_cols = ["Monthly Income", "Transaction Time", "Gender_Female", "Gender_Male", "City_Tier 1",
               "City_Tier 2", "City_Tier 3", "Record"]

In [107]:
x = df_new[feature_cols]
y = df_new["Total Spend"]

In [108]:
lm = LinearRegression()
lm.fit(x, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [109]:
print(lm.intercept_)
print(lm.coef_)

-79.41713030137362
[ 1.47538980e-01  1.54946125e-01 -1.31025013e+02  1.31025013e+02
  7.67643260e+01  5.51389743e+01 -1.31903300e+02  7.72233446e+02]

In [110]:
#Con el list vemos la lista que no ha salido y con el zip unimos las partes que tenmos
list(zip(feature_cols, lm.coef_))

[('Monthly Income', 0.14753898049205738),
 ('Transaction Time', 0.1549461254958966),
 ('Gender_Female', -131.02501325554675),
 ('Gender_Male', 131.02501325554695),
 ('City_Tier 1', 76.76432601049535),
 ('City_Tier 2', 55.138974309232445),
 ('City_Tier 3', -131.9033003197278),
 ('Record', 772.2334457445648)]

In [111]:
lm.score(x, y)

0.9179923586131016

El modelo puede ser escrito como:
 * Total_spend = -79.41713030137362 + Monthly Income'* 0.14753898049205738 + Transaction Time'* 0.1549461254958966)
   ('Gender_Female'* -131.02501325554675) + (Gender_Male'* 131.02501325554695) + ('City_Tier 1'* 76.76432601049535) +
   ('City_Tier 2'*55.138974309232445) + ('City_Tier 3'* -131.9033003197278) + ('Record'* 772.2334457445648).
     * Si es hombre y vive en City Tier 1: -79.41713030137362 + Monthly Income'* 0.14753898049205738 + Transaction Time'* 0.1549461254958966) + (Gender_Male'* 131.02501325554695) + ('City_Tier 1'* 76.76432601049535) + ('Record'* 772.2334457445648).
     * Si es hombre y vive en City Tier 2: -79.41713030137362 + Monthly Income'* 0.14753898049205738 + Transaction Time'* 0.1549461254958966) + (Gender_Male'* 131.02501325554695) + ('City_Tier 2'*55.138974309232445) + ('Record'* 772.2334457445648).
  
Habría que sustituir cada uno que se necesitara según los datos que nos interesa

In [112]:
df_new["prediction"] = -79.41713030137362 + df_new['Monthly Income'] * 0.14753898049205738 + df_new['Transaction Time'] * 0.1549461254958966 + df_new['Gender_Female'] * -131.02501325554675 + df_new['Gender_Male'] * 131.02501325554695 + df_new['City_Tier 1'] * 76.76432601049535 + df_new['City_Tier 2'] * 55.138974309232445 + df_new['City_Tier 3'] * -131.9033003197278 + df_new['Record'] * 772.2334457445648

In [113]:
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3,prediction
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0,4903.696720
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0,4799.434826
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0,5157.082504
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0,8068.012996
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0,3581.980335

In [114]:
SSD = np.sum((df_new["prediction"] - df_new["Total Spend"])**2)
SSD

1517733985.3408163

In [115]:
RSE = np.sqrt(SSD/(len(df_new) - len(feature_cols)-1))
RSE

803.1318809818165

In [116]:
sales_mean = np.mean(df_new["Total Spend"])
sales_mean

6163.176415976714

In [117]:
error = RSE/sales_mean
error*100 #Lo multiplicamos por 100 para verlo en porcentaje

13.031135680294161

## Eliminar vaiables dummy redundantes

In [118]:
dummy_gender = pd.get_dummies(df["Gender"], prefix="Gender").iloc[:,1:]
dummy_gender.head()

   Gender_Male
0            0
1            0
2            1
3            0
4            0

In [121]:
dummy_city_tier = pd.get_dummies(df["City Tier"], prefix="City").iloc[:,1:]
dummy_city_tier.head()

   City_Tier 2  City_Tier 3
0            0            0
1            1            0
2            1            0
3            0            0
4            1            0

In [124]:
column_names = df.columns.values.tolist()
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Male,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,0,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,1,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,0,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,0,1,0

In [127]:
feature_cols = ["Monthly Income", "Transaction Time","Gender_Male","City_Tier 2", "City_Tier 3", "Record"]
X = df_new[feature_cols]
Y = df_new["Total Spend"]
lm = LinearRegression()
lm.fit(X, Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [128]:
print(lm.intercept_)

-133.67781754642238

In [129]:
list(zip(feature_cols, lm.coef_))

[('Monthly Income', 0.14753898049205744),
 ('Transaction Time', 0.15494612549589748),
 ('Gender_Male', 262.05002651109413),
 ('City_Tier 2', -21.625351701262595),
 ('City_Tier 3', -208.66762633022336),
 ('Record', 772.2334457445638)]

In [130]:
lm.score(X, Y)

0.9179923586131016

* Coeficientes con todas las variables

    * [('Monthly Income', 0.14753898049205738),
    *c ('Transaction Time', 0.1549461254958966),
* ('Gender_Female', -131.02501325554675),
* ('Gender_Male', 131.02501325554695),
* ('City_Tier 1', 76.76432601049535),
* ('City_Tier 2', 55.138974309232445),
* ('City_Tier 3', -131.9033003197278),
* ('Record', 772.2334457445648)]

[('Monthly Income', 0.14753898049205744),
 ('Transaction Time', 0.15494612549589748),
 ('Gender_Male', 262.05002651109413),
 ('City_Tier 2', -21.625351701262595),
 ('City_Tier 3', -208.66762633022336),
 ('Record', 772.2334457445638)]